bench/results/machine1/Spock-0.6.1.3/DEEP.log
/home/philopon/bench-0.1.0/wrk/wrk
Benchmarking DEEP
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.24ms   27.22ms 737.51ms   99.83%
    Req/Sec     3.61k   677.23     7.31k    79.31%
  837053 requests in 30.00s, 118.14MB read
Requests/sec:  27903.94
Transfer/sec:      3.94MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.41ms   38.30ms 607.79ms   99.24%
    Req/Sec     3.63k   779.95     9.09k    83.69%
  832440 requests in 30.01s, 117.49MB read
Requests/sec:  27741.62
Transfer/sec:      3.92MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.52ms   11.19ms 380.88ms   99.67%
    Req/Sec     3.58k   846.79     8.67k    82.24%
  832046 requests in 30.01s, 117.44MB read
  Socket errors: connect 0, read 0, write 0, timeout 71
Requests/sec:  27729.82
Transfer/sec:      3.91MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.53ms   10.04ms 700.40ms   99.69%
    Req/Sec     3.61k   699.51     8.67k    80.80%
  834832 requests in 30.00s, 117.83MB read
  Socket errors: connect 0, read 0, write 0, timeout 13
Requests/sec:  27832.33
Transfer/sec:      3.93MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.46ms    8.07ms 427.61ms   99.72%
    Req/Sec     3.62k   713.89     7.28k    83.70%
  831574 requests in 30.01s, 117.37MB read
  Socket errors: connect 0, read 0, write 0, timeout 22
Requests/sec:  27714.03
Transfer/sec:      3.91MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.72ms   30.49ms 686.86ms   99.78%
    Req/Sec     3.57k   780.87     7.82k    67.95%
  827447 requests in 30.00s, 116.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:  27580.10
Transfer/sec:      3.89MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.43ms    7.91ms 592.64ms   99.51%
    Req/Sec     3.59k   788.68     9.93k    80.89%
  828348 requests in 30.00s, 116.92MB read
  Socket errors: connect 0, read 0, write 0, timeout 32
Requests/sec:  27609.39
Transfer/sec:      3.90MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.74ms   23.23ms 567.92ms   99.49%
    Req/Sec     3.61k   781.90     8.57k    84.22%
  832567 requests in 30.00s, 117.51MB read
  Socket errors: connect 0, read 0, write 0, timeout 50
Requests/sec:  27748.57
Transfer/sec:      3.92MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.22ms    4.19ms 260.43ms   97.13%
    Req/Sec     3.63k   678.33     8.28k    68.50%
  836014 requests in 30.00s, 118.00MB read
  Socket errors: connect 0, read 0, write 0, timeout 14
Requests/sec:  27863.81
Transfer/sec:      3.93MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.20ms   41.68ms 695.11ms   99.40%
    Req/Sec     3.62k     0.90k    9.93k    84.12%
  839432 requests in 30.00s, 118.48MB read
Requests/sec:  27977.78
Transfer/sec:      3.95MB
=================== summary ===================
bench target: spock
bench mode:   30s * 10
average:      27770.14
stdev:        125.46