bench/results/machine1/Spock-0.6.1.3/HELLO.log
/home/philopon/bench-0.1.0/wrk/wrk
Benchmarking HELLO
Running 30s test @ http://localhost:8080/echo/hello-world
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.87ms   26.93ms 535.78ms   99.71%
    Req/Sec     4.12k     1.01k   10.71k    78.43%
  949814 requests in 30.00s, 140.40MB read
Requests/sec:  31658.38
Transfer/sec:      4.68MB
Running 30s test @ http://localhost:8080/echo/hello-world
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.54ms    2.73ms 274.65ms   94.68%
    Req/Sec     4.13k     0.86k    9.50k    74.78%
  941749 requests in 30.00s, 139.21MB read
  Socket errors: connect 0, read 0, write 0, timeout 50
Requests/sec:  31388.80
Transfer/sec:      4.64MB
Running 30s test @ http://localhost:8080/echo/hello-world
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.97ms   33.38ms 426.13ms   98.81%
    Req/Sec     4.09k     1.00k   11.00k    85.34%
  944766 requests in 30.00s, 139.65MB read
  Socket errors: connect 0, read 0, write 0, timeout 72
Requests/sec:  31491.11
Transfer/sec:      4.66MB
Running 30s test @ http://localhost:8080/echo/hello-world
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.92ms   24.18ms 468.93ms   99.54%
    Req/Sec     4.10k     1.16k    9.86k    77.91%
  948694 requests in 30.00s, 140.24MB read
  Socket errors: connect 0, read 0, write 0, timeout 38
Requests/sec:  31620.54
Transfer/sec:      4.67MB
Running 30s test @ http://localhost:8080/echo/hello-world
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.29ms   20.15ms 644.63ms   99.84%
    Req/Sec     4.11k     0.94k   11.00k    71.10%
  948860 requests in 30.00s, 140.26MB read
Requests/sec:  31624.36
Transfer/sec:      4.67MB
Running 30s test @ http://localhost:8080/echo/hello-world
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.21ms   27.85ms 550.82ms   99.61%
    Req/Sec     4.10k     0.89k   11.00k    83.34%
  948708 requests in 30.00s, 140.24MB read
Requests/sec:  31621.56
Transfer/sec:      4.67MB
Running 30s test @ http://localhost:8080/echo/hello-world
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.73ms   30.25ms 587.05ms   99.43%
    Req/Sec     4.10k   817.81    11.33k    88.64%
  947038 requests in 30.00s, 139.99MB read
Requests/sec:  31565.61
Transfer/sec:      4.67MB
Running 30s test @ http://localhost:8080/echo/hello-world
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.11ms   38.95ms 664.70ms   99.52%
    Req/Sec     4.11k     1.08k   11.23k    81.07%
  950595 requests in 30.00s, 140.52MB read
Requests/sec:  31684.37
Transfer/sec:      4.68MB
Running 30s test @ http://localhost:8080/echo/hello-world
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.14ms   12.12ms 544.89ms   99.71%
    Req/Sec     4.09k     0.92k    9.08k    79.12%
  940272 requests in 30.01s, 138.99MB read
  Socket errors: connect 0, read 0, write 0, timeout 21
Requests/sec:  31336.23
Transfer/sec:      4.63MB
Running 30s test @ http://localhost:8080/echo/hello-world
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.57ms    1.38ms  86.05ms   89.49%
    Req/Sec     4.12k   798.94     9.36k    70.80%
  945012 requests in 30.00s, 139.69MB read
Requests/sec:  31495.78
Transfer/sec:      4.66MB
=================== summary ===================
bench target: spock
bench mode:   30s * 10
average:      31548.67
stdev:        117.26